Courses/7140/Lectures/Overview/simple-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-29 Sat 19:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple Programming Problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Simple Programming Problems</h1>
<p>
What are some simple programming problems?
</p>

<div id="outline-container-org8af8d57" class="outline-2">
<h2 id="org8af8d57"><span class="section-number-2">1</span> /bin/ls</h2>
<div class="outline-text-2" id="text-1">
<p>
Everyone is familiar with the <code>/bin/ls</code> of Unix/Linux.  Is this a
"simple" problem?  How difficult (e.g., in man-hours) do you think it
is to a "Specifications of ls" document?  Did the (original)
developers have this doc?  How long might it take you to design and
implement a new ls?
</p>

<p>
Suppose we simplify this problem to just doing "ls" with no options,
and no arguments.  Here is an incomplete list of (definition) tasks
</p>

<ol class="org-ol">
<li>Current Working Directory (CWD)</li>
<li>Raw (unformatted) Listing of CWD contents</li>

<li>Should /bin/ls take on the responsibility of "correct" listing?</li>

<li>Columnizing the listing</li>
</ol>
</div>
</div>

<div id="outline-container-org0414446" class="outline-2">
<h2 id="org0414446"><span class="section-number-2">2</span> The Dutch National Flag Problem</h2>
<div class="outline-text-2" id="text-2">
<p>
An array a[1..n] is filled with elements colored red, white or
blue. Design an algorithm that rearranges the elements so that all the
red-elements are at the left, all the blues are at the right, and the
whites are in the middle.
</p>

<p>
Non-functional requirements: Do not assume that (i) red, white and
blue are named integer constants; (ii) nor that red &lt; white &lt; blue.
</p>

<p>
Can you write, in an afternoon, the algorithm/program?  One that is
guaranteed to work?
</p>
</div>
</div>

<div id="outline-container-orgdd7c391" class="outline-2">
<h2 id="orgdd7c391"><span class="section-number-2">3</span> Condense the List of Numbers</h2>
<div class="outline-text-2" id="text-3">
<p>
Problem Statement: You are given a comma separated list of items in a
text file. The list is terminated with a period. Each item is either a
number, or a hyphen separated pair of numbers. Your program should
condense this list as much as possible, as can be seen from the
following examples.
</p>

<p>
<code>1,3,4,2,6,5,8,5,7. becomes</code><br />
<code>1-8.</code>
</p>

<p>
<code>9,100-4870,4993,4871-4875,5016,5118,7-250,5100-5123. becomes</code><br />
<code>7-4875,4993,5016,5100-5123.</code>
</p>

<p>
<code>1103,1023-1100,87654321,1050-1150,1110,1250-1344. becomes</code><br />
<code>1023-1150,1250-1344,87654321.</code>
</p>

<p>
How would you proceed?  Will you do requirements analysis, specs,
design, implement, test, &#x2026; in that order?  Or, will you jump into
"coding" and testing through which you discover things?
</p>
</div>
</div>

<div id="outline-container-org66cc605" class="outline-2">
<h2 id="org66cc605"><span class="section-number-2">4</span> Bubble Sort</h2>
<div class="outline-text-2" id="text-4">
<p>
You undoubtedly learnt Bubble Sort.  May be many versions.
</p>

<p>
In our CS7140, we are not that interested in efficiency (BigOh
notation, etc.) as we are in elegance, and correctness.  We can
certainly define correctness for sorting.  May be not "elegance".
</p>

<p>
Try writing down the correctness criteria.  Try developing a test
harness for this.  Are these two tasks "simple" (enough)?
</p>
</div>
</div>

<div id="outline-container-org1e6db55" class="outline-2">
<h2 id="org1e6db55"><span class="section-number-2">5</span> Quick Sort</h2>
<div class="outline-text-2" id="text-5">
<p>
You undoubtedly learnt Quick Sort also.  May be just one version.
Re-read it.  E.g., read <a href="https://algs4.cs.princeton.edu/23quicksort/">https://algs4.cs.princeton.edu/23quicksort/</a>
from the book by Sedgewick and Wayne.
</p>

<p>
Do a new version with the following constraint.  You are given the
array a, and permitted to use index variables i, &#x2026;, etc.  But, not
allowed to do any assignments to a[i].  Instead, you are encouraged to
use a primitive named <code>exchanged(i, j)</code> that exchanges a[i] with a[j].
Is this a simple task?  Is the resulting program simple?
</p>
</div>
</div>

<div id="outline-container-orged9fc55" class="outline-2">
<h2 id="orged9fc55"><span class="section-number-2">6</span> CWP (Common Words Problem)</h2>
<div class="outline-text-2" id="text-6">
<p>
"Given a file of text, and a number k, print the k most common words."
Is this a simple problem?  Can you understand an implementation
of this "quickly"?
</p>

<p>
We will be spending several lectures on this problem and one of its
solution by Donald E. Knuth, "A Solution to the Common Words Problem",
Communications of the ACM, 1986. Knuth is a Turing Award
winner.
</p>
</div>
</div>

<div id="outline-container-orgde84af8" class="outline-2">
<h2 id="orgde84af8"><span class="section-number-2">7</span> An Exercise on Bit Sequences</h2>
<div class="outline-text-2" id="text-7">
<p>
Consider sequences of b bits.  Each such sequence has (b - 4) 5-bit
subsequences of adjacent bits.  For example, the sequence 1101011&#x2026;
contains the 5-bit subsequences 11010, 10101, 01011,&#x2026;  Given a file
of sequences of b bits, we wish for an algorithm/ program that would
print all and only the b-bit sequences with the two properties: (1)
the first 5 bits are 00000, and (2) no two 5-bit subsequences are the
same.
</p>

<ol class="org-ol">
<li>Formally specify the informal description.</li>
<li>Efficiency is not a priority, but do not make it super slow.</li>
<li>Correctness is super important.</li>
<li>Elegance (also) is super important.  For now, elegance is is the
ease with which you can convince a colleague of yours that it works
just by reading it, long before she tries to execute it.</li>
<li>Does your program generalize to sequences of arbitrary characters?
How easily?</li>
</ol>
</div>
</div>



<div id="outline-container-org5af0a02" class="outline-2">
<h2 id="org5af0a02"><span class="section-number-2">8</span> Self Analysis</h2>
<div class="outline-text-2" id="text-8">
<p>
As a software engineer can you "solve" (at least) these and other
problems of this range of complexity?
</p>
</div>
</div>

<div id="outline-container-orge4eeb50" class="outline-2">
<h2 id="orge4eeb50"><span class="section-number-2">9</span> End</h2>
<div class="outline-text-2" id="text-9">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2020-08-27
</div>
</body>
</html>
